<?php
/////////////////////////////////// PRODUCTIONS SETTING
$is_pro = 1;

// Table
$table_add          = 'address';
$table_ur           = 'user';
$table_cu           = 'customer';
$table_ct           = 'category';
$table_po           = 'product';
$table_pj           = 'project';

$setWeburl[0]   = "127.0.0.1:8005";
$setWeburl[1]   = "127.0.0.1:8005";

$websiteUrl     = $setWeburl[$is_pro];

// Payment GB Prime
$secreatkey_gb = "CZsRquwGK9j9UYrUxG1jfq0xzeM69woD";
// APIcallback
$web_callback = "https://app.evall.co/member/payment/paymentCheckStatus";

//Pro
$line_token = 'CZsRquwGK9j9UYrUxG1jfq0xzeM69woD';
$to_admin = ""; //U2ae658e66985523fe70d087dd5bda164

// Token Config
$secret_key = "themoonchildpakapononkrid";  // key
$secret_key_refresh = "themoonchildpakapononkrid";  // key
$expiretimesec = 86400; // sec 
$expiretimesec_refresh = 2592000; // sec


$bank_list = array(
    "1" => "ธนาคารกรุงเทพ จำกัด (มหาชน)",
    "2" => "ธนาคารกรุงไทย จำกัด (มหาชน)",
    "3" => "ธนาคารกสิกรไทย จำกัด (มหาชน)",
    "4" => "ธนาคารไทยพาณิชย์ จำกัด (มหาชน)",
    "5" => "ธนาคารทีเอ็มบีธนชาต จำกัด (มหาชน)",
    "6" => "ธนาคารกรุงศรีอยุธยา จำกัด (มหาชน)",
    "7" => "ธนาคาร ซี ไอ เอ็ม บี ไทย จำกัด (มหาชน)",
    "8" => "ธนาคารทิสโก้ จำกัด (มหาชน)",
    "9" => "ธนาคารเกียรตินาคินภัทร จำกัด (มหาชน)",
    "10" => "ธนาคารยูโอบี จำกัด (มหาชน)",
    "11" => "ธนาคารสแตนดาร์ดชาร์เตอร์ด (ไทย) จำกัด (มหาชน)",
    "12" => "ธนาคารไทยเครดิตเพื่อรายย่อย จำกัด (มหาชน)",
    "13" => "ธนาคาร แลนด์ แอนด์ เฮ้าส์ จำกัด (มหาชน)",
    "14" => "ธนาคารไอซีบีซี(ไทย) จำกัด (มหาชน)",
    "15" => "ธนาคารออมสิน",
    "16" => "ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร",
    "17" => "ธนาคารอาคารสงเคราะห์",
    "18" => "ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย",
    "19" => "ธนาคารอิสลามแห่งประเทศไทย",
    "20" => "ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย",
    "21" => "บรรษัทประกันสินเชื่ออุตสาหกรรมขนาดย่อม",
    "22" => "บริษัทบริหารสินทรัพย์ กรุงเทพพาณิชย์ จำกัด (มหาชน)",
    "23" => "บริษัทเงินทุน ศรีสวัสดิ์ จำกัด (มหาชน)",
    "24" => "บริษัทเงินทุน แอ็ดวานซ์ จำกัด (มหาชน)",
    "25" => "ธนาคารแห่งประเทศจีน (ไทย) จำกัด (มหาชน)",
    "26" => "ธนาคารซุมิโตโม มิตซุย ทรัส"
);
